{
  	introduction: '"The Liberated Lovership" by Hēsperus advocates for a radical redefinition of love, rejecting traditional marriage as oppressive. It promotes relationships based on genuine love, free from gender, age, or moral constraints, and calls for societal reforms like abolishing inheritance and gender roles. A manifesto for LGBTQIA+ rights, multi-partner relationships, and emotional authenticity.',
  	content: '\
		<h1>The Liberated Lovership</h1>\
		<hr/>\
		<img src="https://img1.tucang.cc/api/image/show/b1ccfcace0d0565854fe957d1ebe6249" alt="Liberated Lovership"/>\
		<h3>✨ Exordium</h3>\
		<p>Love and marriage, two <strong>eternally immutable</strong> topics rooted in people\'s minds throughout history, need <strong>revolutionizing</strong> more urgently than ever before. Since the first humanoid began to harbour Eros, the pilgrimage and evolution of love started. From patriarchy to monogamy, it was dipped into the yell in the first wave of sexual liberation and thrived in the presence of the LGBT movement. Far-sighted vanguards from the populace shine like beacons, guiding the world forward.</p>\
		<p>The current concept insists on the norms of matrimony, which <strong>imprisons</strong> individuals through various <strong>ossified moral shackles</strong>. The prevalence of affectional TV series and the highly debated gender issues on mass media didn\'t, cannot, and won\'t liberate humanity from these rigid dilemmas. Ironically, they <strong>please the massive</strong> by complying with these rules as if they are <strong>revelations emerging on altars</strong>.</p>\
		<hr/>\
		<h3>✒️ Definitions</h3>\
		<img src="https://img1.tucang.cc/api/image/show/4d0b0e32db33de510e425816f6ca68d2" alt="LGBT"/>\
		<h4>🗽 Liberated Lovership Explained</h4>\
		<p><strong>Liberated lovership</strong>, in Hēsperus\' viewpoint, is a relationship between individuals with the attributes below:</p>\
		<ol>\
		  	<li>based on the <strong>Genuine Love</strong> and <strong>distinguished with matrimony</strong>;</li>\
		  	<li>regardless <strong>ages</strong>, <strong>gender</strong> or other <strong>innate distinctions</strong>, and free from the <strong>alienation of money</strong>;</li>\
		  	<li>free to start or terminate a lovership, and free from the <strong>expropriation of banal morality</strong>.</li>\
		</ol>\
		<p>To make it understandable, Hēsperus uses a more straightforward yet not comprehensive interpretation here (these entries are all based on <strong>Liberated Lovership</strong>, and equally apply to everyone involved in romances):</p>\
		<ol>\
		  	<li>Lovers don\'t need to be related with marriage or sex;</li>\
		  	<li>Hēsperus supports <strong>🏳️‍🌈 LGBTQIA+</strong>, <strong>early romance</strong> and <strong>intergenerational romance</strong>;</li>\
		  	<li>People can fall in love with whomever they want if they both desire, even <strong>multi-lovership</strong> is permitted; they can also choose to end a love whenever they want. The issue of love and sex is not a confidentiality or a politically sensitive problem, people can discuss it freely.</li>\
		</ol>\
		<h4>💞 Genuine Love Explained</h4>\
		<p><strong>Genuine Love</strong> is a coordination based on <strong>mutual</strong> affections, which should contain:</p>\
		<ol>\
		  	<li><strong>Sexual Attraction</strong>;</li>\
		  	<li>psychological <strong>dependence, belonging, authenticity and understanding</strong>;</li>\
		  	<li>rational affection, respect, and behaviour depending on the <strong>pursuit of love</strong>.</li>\
		</ol>\
		<p>Lovership features <strong>Sexual Attraction</strong>, but any lovership that lacks either <strong>psychological dependence, belonging, authenticity and understanding</strong> or <strong>rational affection, respect, and behaviour depending on the pursuit of love</strong> is considered a <strong>💔 flawed lovership</strong>, not <strong>Liberated Lovership</strong>. Hēsperus doesn\'t think it is advisable or can be lasting.</p>\
		<p>What it <strong>shouldn\'t</strong> contain:</p>\
		<ol>\
		  	<li>the relationship based on <strong>profit</strong> transactions;</li>\
		  	<li><strong>control and manipulation</strong> from one to another;</li>\
		  	<li>conventional <strong>Love Morality</strong>;</li>\
		  	<li>any other <strong>reluctant enforcements</strong>.</li>\
		</ol>\
		<h4>🦋 Sexual Terms Explained</h4>\
		<p><strong>Sexual Attraction</strong> is desire driven by sexual enchantment, which is not shackled by sexual behaviour or isomerism. It can emerge in homosexual contexts, and not all sexual attraction can lead to sexual behaviours;</p>\
		<p><strong>Sexually Inconsequential Behaviour</strong> is a sex behaviour that won\'t impose pregnancy, through means like <strong>contraception</strong> and <strong>abortion</strong>;</p>\
		<p><strong>Sexually Consequential Behaviour</strong> is a sexual behaviour that is aimed at obtaining a <strong>baby</strong>.</p>\
		<p>It\'s crucial to clarify that having sexual behaviour does not mean harbouring sexual attraction, and vice versa.</p>\
		<h3>🩷 Pursuit of Love</h3>\
		<img src="https://img1.tucang.cc/api/image/show/b628679e9e8064e76c91c8088b977533" alt="Symposium"/>\
		<p>Why do people love?</p>\
		<ul>\
		  	<li>Someone claims that love enables human beings to pair up and reproduce, further continuing the immortality of human civilisation. That\'s <strong>ludicrous</strong>, mosquitoes also need breeding. It\'s common sense that creatures as humble as mosquitoes cannot harbour affection for other ones, so Hēsperus holds the view that reproduction doesn\'t require love. To put it another way, the <strong>Sexually Consequential Behaviour</strong> should not be related to love.</li>\
		  	<li>Modern media disseminate that love means 🌹 romance, 🥰 intimation, 🌱 youth, 💎 gorgeousness, 🙈 impulse of sex and any other objectified embodiments as if they are sunk into marble pantheons and surrounded by an atmosphere of neon illuminations. That\'s <strong>superficial</strong>, it ignores the psychological demand of human beings, continuing to objectify it as the correspondence of emotion between lovers and petty bourgeoisie interactions, stigmatizing it through the emphasis of so-called <strong>love morality</strong>.</li>\
		  	<li>Careerists insist that love equals marriage. Thus, it should serve as a means of social climbing and hypocritical satisfaction of "more children, more blessings". They try to quantify all the drawbacks and benefits brought by marriage, proposing lovers should be dipped into the sewage of utilitarianism, and paying no attention to people\'s characteristics and initiative. They often feature ruthless arranged marriages and patriarchy in families, which is <strong>anti-human</strong>.</li>\
		</ul>\
		<p>In Hēsperus\' view, love is a process of reviving pure affections and dependency only existing in childhood, enabling lovers to seek a "second self" as a harbour to accommodate their temperaments. Love is seen as a key to happiness, virtue, and the realization of one\'s full potential, a person who lacks love is broken, only love can salvage people from the perplexity and nihility in a fast-beat world. Love starts from <strong>Sexual Attraction</strong>, but furthers it to any aspects of people\'s lives, also the psychological <strong>dependence, belonging, authenticity and understanding</strong>.</p>\
		<p>People love, because they <strong>desire love</strong>. We see an <strong>idealization</strong> of ourselves, we see beauty, integrity and perfection which we lack, so we love. Everyone below the firmament is <strong>born with defects and the certainty of mortality</strong>, but we dedicate ourselves to <strong>strive for perfection and eternity</strong>, that is the <strong>essence of love</strong>, and also the <strong>essence of live and existence</strong>. Humanity has fully comprehended that the <strong>material is easy to fade</strong>, but the <strong>human ideal cannot be effaced</strong>. Consequently, we begin to desire, pursue, express and create. In the journey of consummation, we gain happiness, well-being, and <strong>love</strong>.</p>\
		<h3>👰 Lovership and Matrimony</h3>\
		<img src="https://img1.tucang.cc/api/image/show/1ef7c1490c9f292af671eccc0475b05a" alt="wedding"/>\
		<p>Sexual Attraction serves as a frontier, distinguishing lovership from friendship or kinship. Lovership does not require lovers to <strong>get married or give birth to a child</strong>, anyone trying to correlate lovership with matrimony or baby is actually <strong>alienating</strong> love.</p>\
		<p>So why should matrimony exist?</p>\
		<p>🤵‍♂️ <em>Friedrich Engels</em> posited, in 📕 <em>The Origin of the Family, Private Property and the State</em> , that monogamous marriage originated from the <strong>concentration of wealth</strong> in the hands of individual men and their desire to ensure that this wealth could be passed down to their biological offspring. It is obvious that the marriage is born to be <strong>selfish</strong>. This form of marriage is characterized by the <strong>subjugation</strong> of women, who were confined to domestic roles and forced into a life of <strong>unpaid labour</strong> focused on child-rearing and household management. The reason marriage emphasises durability may be to facilitate the growth of their children but inevitably sinks into the swamp of societal inequality and the ossification of love. There is an emerging sense amongst people that marriages backfire love. It is not a contract ensuring genuineness, but more like a <strong>shackle imprisoning free will</strong> and <strong>alienating lovers</strong>, especially <strong>females</strong>.</p>\
		<p><strong>Absurd social morality</strong> often deceives us that the lovers is designated to get married, and couples should have children, a matrimony should be eternal and exclusive until death. Moreover, it has coined a host of fantasies and stupid rhetoric to confuse the populace, camouflaging it as a divine process that must pass through. Inarguably, the propaganda of it is a complete triumph, almost everyone falls prostrate and deifies it piously <strong>as if it is an unchangeable rule</strong>. What companies it, is the <strong>annihilation of humanities</strong> and the <strong>ignorance of the flexibility of human temperament</strong>. In most cases, the lasting progress of marriage will be ultimately transformed into a kind of <strong>flawed lovership</strong>, a <strong>slavery</strong>, a <strong>legitimate prostitution</strong>.</p>\
		<p>Naysayers always allege irresponsibly that all people have been entitled to the right to love freely and the freedom of matrimony and divorce, which indicates that lovership is originally liberal. This is a <strong>misunderstanding of freedom</strong> de facto. True freedom is <strong>multidimensional</strong> -- including political freedom, economic freedom (not refer to free-market here), structural freedom, cultural freedom, etc. Love participants seemingly own the freedom, the social ethics, however, reject it, and conservative parents curse them with flushing faces. The <strong>Liberated Lovership</strong> can be ushered only if an "overall reform" has taken place.</p>\
		<p>In Hēsperus\' ideal, the solutions are: <strong>the deprivation of the right of inheritance</strong>, <strong>social upbringing</strong>, and <strong>public ownership</strong>. This is not an ingenious idea, as early as 1848 AD, 🤵‍♂️ <em>Karl Marx</em> and 🤵‍♂️ <em>Friedrich Engels</em> announced it in 📙 <em>Communist Manifesto</em> . After implementing such policies, the duty of raising kids is no longer attached to couples, so matrimony will have lost its necessity to exist. It is not tantamount to smashing romances. However, <strong>⛓️‍💥 WE HAVE NOTHING TO LOSE BUT OUR CHAINS</strong>, an <strong>entirely new, free and redefined</strong> love is waiting for us.</p>\
		<p>We know that aforesaid solutions may be too utopian and optimistic, but at least, all the authorities can acknowledge, and people can begin adapting to the following statements <strong>right now</strong>:</p>\
		<ol>\
		  	<li>Distinguish and <strong>disconnect</strong> lovership and marriages, realizing that lovership means mutual affection, especially <strong>Liberated Lovership</strong>; and marriages only stand for the responsibility of <strong>Sexually Consequential Behaviour</strong>;</li>\
		  	<li>Abolish any taboos about <strong>LGBTQIA+</strong>, <strong>early romance</strong>, <strong>intergenerational romance</strong>, <strong>multi-lovership</strong> and <strong>gender discriminations in marriages</strong>;</li>\
		  	<li><strong>Reshape societal morality</strong>, emphasising the difference between lovership and marriages, eliminating taboos, and promoting <strong>love egalitarianism</strong>.</li>\
		</ol>\
		<h3>😣 Alienation is Anywhere</h3>\
		<img src="https://img1.tucang.cc/api/image/show/0c2656036dc7a3f110f628ec47f63690" alt="Communist Manifesto"/>\
		<p>If we take a small glimpse at the social life we are having, we will discover with astonishment that the modern world has been <strong>generally alienated</strong>! 🤵‍♂️ <em>Henri Lefebvre</em> pointed out in his critique of daily life, that half of humans are distinguished from other counterparts, entitled with the name "women", educated under so-called "female criteria". Similarly, the rest of humans pose as "men", continuing to defraud themselves as the dominance over other "women". This division may be implemental in the prehistorical epoch when humanoids centred on the <strong>reproduction of people</strong> (there are three stages in human history: <strong>reproduction of people</strong>, <strong>production of goods</strong>, and <strong>creation of spiritual wealth</strong>) because it can systematize the organization of reproduction in tribes. Nonetheless, it no longer makes sense in later eras. Assuming that females have no discrepancy with males regardless of physical difference, they should not have <strong>polarized social strata</strong> except reproduction.</p>\
		<p>Sadly, in the factual timeline, this tendency hasn\'t stopped, but fabricated a host of gender norms, gender beauty, gender education, and gender obligations, to name a few. Anyone who tries to overthrow these <strong>gender cocoons</strong> is reprimanded as a "<strong>monster</strong>", and "<strong>abnormality</strong>", as if the gender discrepancy is born with the universe. Gender stereotypes have shaped a cycle, which forces all people to be educated under gender stereotypes, making them perform like "standard gender personalities", and reinforcing the perception of gender in our minds on the other hand. We witnessed the rise of feminism and the prevalence of the LGBT movement. It can\'t be denied that they all played essential and progressive roles in shaping the world, but they all ignored the fundamental point, that it\'s not the gender discrimination which matters, but the <strong>concept of gender itself</strong>. When people finally reject such perception, the  LGBTQIA+ cohort would be no longer a "minority", but <strong>as normal as other ones</strong> in the society. Meanwhile, <strong>gender discrimination</strong> will disappear. In particular, in a highly modernized nation establishing a <strong>social upbringing</strong> institution, the actual disparity between genders can be minimized, where ultimate <strong>gender equality</strong> will be feasible.</p>\
		<p>Age discrimination in lovership is an absolute empty word. We can see lifeless youngsters, also capriccioso and active seniors. Classifying people merely by superficial traits like age and gender is fairly arbitrary. In most cases, the <strong>intergenerational lovership</strong> in our readers\' minds is only <strong>intergenerational friendship</strong> or <strong>kinship</strong>, for it doesn\'t virtually involve <strong>sexual attraction</strong>.</p>\
		<p>Then let\'s talk about <strong>early romance</strong>. Especially in East Asian countries, school teachers and parents coined it to refer to the <strong>lovership among students or juveniles</strong>, regarding it can hamper students\' academic excellence but <strong>with no evidence</strong>. Hēsperus gives a breakdown of this issue:</p>\
		<ol>\
		  	<li>The <strong>alienation of school role</strong>: The school is a place for students to achieve <strong>comprehensive development</strong>, including <strong>setting a correct value of love</strong>. However, East Asian teachers and parents all have cold feet with cowardice when countering this issue, attempting to address it by prohibiting school lovership autocratically, which is <strong>irresponsible</strong> and <strong>foolish</strong>. The conceivable outcome is, that students become depressed in an oppressive atmosphere, somewhat freaky in their love values, and teachers and parents become insane with suppressing student lovership. The school is no longer an educational sanctuary that cultivates healthy, confident and optimistic youngsters, but a <strong>detention factory</strong> manufacturing glittery yet flawed machines.</li>\
		  	<li>The <strong>alienation of lovership</strong>: The abuse of love by students is responsible for this problem as well. However, it\'s not their fault. Commonly, all mammal has a rutting period. The genesis of it is the absence of a <strong>correct love value</strong>. Under the influence of modern media, it is easy for them to barely regard it as <strong>romance, intimation, youth, gorgeousness, the impulse of sex and so on</strong>, which is shortsighted. Consequently, students often fall into <strong>flawed loverships</strong>. Some of their lovership is based on <strong>purely sexual attraction</strong>, alienating the <strong>healing power of love to sexual satisfaction</strong>, or more radically, <strong>volunteer prostitution</strong>. To this, Hēsperus neither approves it nor vindicates it.</li>\
		  	<li>Importance of <strong>Liberated Lovership</strong>: Hēsperus believes that a appropriate <strong>value of love</strong>, such as <strong>Liberated Lovership</strong> is the very solution for it. It is reasonable to believe that lovers in a genuine <strong>Liberated Lovership</strong> are fully rational because they can comprehend the essence of love and what they can virtually attain in a romance. They entrust their relationship to their communal comprehension and respect, rather than fragile sexual affection or eros. Although this hasn\'t been testified, schools and families cannot use this as a pretext to refuse a beneficial trial that <strong>enables lovership to be put to positive use</strong>.</li>\
		</ol>\
		<hr/>\
		<h3>📜 Conclusion</h3>\
		<img src="https://img1.tucang.cc/api/image/show/8c06d219b88fcb9ef38edf2c63b67c7d" alt="RevoLution"/>\
		<p>Now, it is the very moment for Hēsperus to reiterate his view of love:</p>\
		<p>Lovership should be <strong>liberal</strong>, lovers must be <strong>universally egalitarian</strong>, and marriages are born to be <strong>liberated</strong>! Engagements alienated by so-called family obligations and societal stereotypes should only exist in the inferno. We are here manifest to the globe: <strong>Ossified norms deserve to die, live long the Liberated Lovership! 🚩</strong></p>\
		<p style="text-align: right;">100% Original | Copyright ©️ Hēsperus | 4 April 2025</p>\
	'
}