{
    "introduction": "Der Inhalt erklärt, wie faschistische Regime psychologische Phänomene wie Massenhysterie, Deindividuation und Terror-Management-Theorie nutzen, um die Gesellschaft zu manipulieren, Angst zu erzeugen und Kontrolle zu etablieren.",
    "content": "<h1>Wie Faschisten sich verbreiten</h1> <hr /> <p>Es gibt drei Hauptpsychologische Phänomene, die vom Faschismus und anderen autokratischen Regimen genutzt werden, sie sind:</p> <ol> <li>Massenhysterie;</li> <li>Deindividuation;</li> <li>Terror-Management-Theorie.</li> </ol> <hr /> <img src='https://pic1.imgdb.cn/item/67bfe7e8d0e0a243d406a9ce.jpg' alt='Propaganda' /> <p>Zunächst schaffen faschistische Führer eine Atmosphäre der Solidarität und des Kollektivs, indem sie die Überlegenheit von Rasse, Nation und Partei propagieren.</p> <img src='https://pic1.imgdb.cn/item/67bfe920d0e0a243d406ac62.jpg' alt='Rede' /> <p>Durch die Schaffung eines Gefühls der Zusammengehörigkeit ist dieser Schritt die Grundlage, um die Massen zu verführen.</p> <hr /> <img src='https://pic1.imgdb.cn/item/67bfe93bd0e0a243d406acd7.jpg' alt='Dämonisierung' /> <p>Dann, oft während einer Krise, schreiben faschistische Politiker die Situation äußeren Feinden zu, dämonisieren sie als Quelle der Katastrophe und erzeugen so Angst in der Gesellschaft.</p> <img src='https://pic1.imgdb.cn/item/67bfe97ad0e0a243d406ad69.jpg' alt='Massenhysterie' /> <p>In diesem Schritt tritt der Effekt der <strong>Massenhysterie</strong> auf, Menschen neigen eher dazu, eine Illusion von Angst, Unterdrückung und Bedrohung zu haben.</p> <hr /> <img src='https://pic1.imgdb.cn/item/67bfe9bed0e0a243d406ae40.jpg' alt='Spektakel' /> <p>In den offiziellen Medien sind große, staatliche Kräfte und charismatische, mächtige Herrscher oft zentrale Inhalte. Politische Großgesten und öffentliche Spektakel werden im ganzen Land veranstaltet, mit Tausenden und Millionen von Zuschauern.</p> <img src='https://pic1.imgdb.cn/item/67bfe9e4d0e0a243d406ae49.jpg' alt='Deindividuation' /> <p>In solch massiven Szenarien treibt die <strong>Deindividuation</strong> Menschen dazu, sich irrational und extrem mit der Masse zu verhalten, wodurch sie ihre Individualität verlieren.</p> <hr /> <img src='https://pic1.imgdb.cn/item/67bfea56d0e0a243d406ae78.jpg' alt='Heiligkeit des Todes' /> <p>In faschistischen Militärs wird die Heiligkeit des Todes stets betont, als Symbol der Loyalität und der Verbindung zu einem größeren Zweck und einer Existenz, die über das Individuum hinausgeht.</p> <img src='https://pic1.imgdb.cn/item/67bfea80d0e0a243d406aef1.jpg' alt='Beziehung zur Nation' /> <p>Wie die <strong>Terror-Management-Theorie</strong> erklärt, neigen Menschen, wenn sie mit ihrer eigenen Sterblichkeit konfrontiert werden, dazu, kulturelle Weltanschauungen stärker zu akzeptieren. Im Kontext faschistischer Werte kann diese Abhängigkeit vom Glauben zur Bildung radikaler Kulte und faschistischer Bewegungen führen.</p> <hr /> <img src='https://pic1.imgdb.cn/item/67bfeaa7d0e0a243d406af61.jpg' alt='Rückblick' /> <p>Es gibt mehrere Interpretationen dieser Phänomene. Die verbreitetste reicht bis in die prähistorische Ära zurück, als Menschen ums Überleben kämpften. Jene, die sich am meisten für mögliche Gefahren interessierten, die sich in den Gesichtsausdrücken anderer zeigten, hatten die größte Überlebenschance.</p> <hr /> <h2>Referenzen</h2> <ol> <li> LaKeisha Fleming, 8. Januar 2024, <a href='https://www.verywellmind.com deindividuation-7546896'>Deindividuation: Wie die Anwesenheit anderer das Verhalten beeinflusst</a> </li> <li> Lisa Fritscher, 12. Dezember 2023, <a href='https://www.verywellmind.com/understanding-groupthink-2671595'>Was ist Massenhysterie (Massenpsychose)?</a> </li> <li> Mark Neocleous, Februar 2005, <em>Es lebe der Tod! Faschismus, Auferstehung, Unsterblichkeit</em>, aus Journal of Political Ideologies (Februar 2005), 10 (1), 31–49 </li> <li> Practical Psychology, 20. Oktober 2023, <a href='https://practicalpie.com/terror-management-theory/'>Terror-Management-Theorie (Definition + Beispiele)</a> </li> </ol>"
} 