{
	introduction: 'The content explains how fascist regimes use psychological phenomena such as mass hysteria, deindividuation, and terror management theory to manipulate society, create fear, and establish control.',
	content: '\
		<h1>How Fascists Propagate</h1>\
		<hr />\
		<p>There are three main psychological phenomena used by fascism and other autocratic regimes, they are:</p>\
		<ol>\
		    <li>Mass Hysteria;</li>\
		    <li>Deindividuation;</li>\
		    <li>Terror Management Theory.</li>\
		</ol>\
		<hr />\
		<img src="https://pic1.imgdb.cn/item/67bfe7e8d0e0a243d406a9ce.jpg" alt="Advocation" />\
		<p>At first, fascist leaders construct an atmosphere of solidarity and cohesion by advocating the superiority of race, nation, and party.</p>\
		<img src="https://pic1.imgdb.cn/item/67bfe920d0e0a243d406ac62.jpg" alt="speech" />\
		<p>By creating a sense of co-belonging, this step is the foundation of bewitching the masses.</p>\
		<hr />\
		<img src="https://pic1.imgdb.cn/item/67bfe93bd0e0a243d406acd7.jpg" alt="Demonization" />\
		<p>Then, often during the crisis, fascist politicians ascribe the situation to some exterior enemies, demonizing them as the source of catastrophe, rending a sense of fear in the society.</p>\
		<img src="https://pic1.imgdb.cn/item/67bfe97ad0e0a243d406ad69.jpg" alt="mass hysteria" />\
		<p>In this step, the effect of <strong>Mass Hysteria</strong> emerges, people are more likely to have an illusion of fear, oppression and threat.</p>\
		<hr />\
		<img src="https://pic1.imgdb.cn/item/67bfe9bed0e0a243d406ae40.jpg" alt="spectacle" />\
		<p>In official media, stately massive forces, and charming powerful rulers, such strong contrast is typically the content. Political grand gestures and public spectacles are frequently held all over the nation, with thousands and millions of audiences.</p>\
		<img src="https://pic1.imgdb.cn/item/67bfe9e4d0e0a243d406ae49.jpg" alt="deindividuaion" />\
		<p>In such a massive scenario, the <strong>Deindividuation</strong> drives people to do crazy and irrational behaviours with a big group of people, losing their individuality.</p>\
		<hr />\
		<img src="https://pic1.imgdb.cn/item/67bfea56d0e0a243d406ae78.jpg" alt="scanty of death" />\
		<p>In fascist military, the sanctity of death is always emphasized, as a symbol of loyalty and the connection of certain grander purposes and existence beyond a single individual.	</p>\
		<img src="https://pic1.imgdb.cn/item/67bfea80d0e0a243d406aef1.jpg" alt="relation of nation" />\
		<p>As the <strong>Terror Management Theory</strong> introduces, when people are confronted with reminders of their mortality, they become more likely to embrace cultural worldviews. In the context of fascist values, such reliance on belief can result in the formation of radical cults and fascists.</p>\
		<hr />\
		<img src="https://pic1.imgdb.cn/item/67bfeaa7d0e0a243d406af61.jpg" alt="date back" />\
		<p>Multiple interpretations have been found of these phenomena. And the most communal one can be dated back to the prehistoric era when humans were still struggling to survive. Those who follow the massive concern about any potential danger demonstrated on others\' faces would be most likely to live.</p>\
		<hr />\
		<h2>References</h2>\
		<ol>\
		    <li>LaKeisha Fleming, 8 January, 2024, <a href="https://www.verywellmind.com/deindividuation-7546896">Deindividuation: How the Presence of Others Affects Behavior</a></li>\
		    <li>Lisa Fritscher, 12 December, 2023, <a href="https://www.verywellmind.com/understanding-groupthink-2671595">What Is Mass Hysteria (Mass Psychosis)?</a></li>\
		    <li>Mark Neocleous, February 2005, <em>Long live death! Fascism, resurrection, immortality</em>, retrieved from Journal of Political Ideologies (February 2005), 10 (1), 31–49</li>\
		    <li>Practical Psychology, 20 October, 2023, <a href="https://practicalpie.com/terror-management-theory/">Terror Management Theory (Definition + Examples)</a></li>\
		</ol>\
	'
}