{
    introduction: 'Der Inhalt erklärt, wie faschistische Regime psychologische Phänomene wie Massenhysterie, Entindividualisierung und die Terror-Management-Theorie nutzen, um die Gesellschaft zu manipulieren, Angst zu schüren und Kontrolle auszuüben.',
    content: '\
        <p>Es gibt drei Hauptpsychologische Phänomene, die von Faschismus und anderen autoritären Regimen genutzt werden:</p>\
        <ol>\
            <li>Massenhysterie;</li>\
            <li>Entindividualisierung;</li>\
            <li>Terror-Management-Theorie.</li>\
        </ol>\
        <hr />\
        <img src="https://img1.tucang.cc/api/image/show/323a9bfde05017280127ee81272af305" alt="Propaganda" />\
        <p>Zunächst konstruieren faschistische Führer eine Atmosphäre der Solidarität und Kohäsion, indem sie die Überlegenheit von Rasse, Nation und Partei propagieren.</p>\
        <img src="https://img1.tucang.cc/api/image/show/a5cf430e635e875498bb5905a2f107a4" alt="Rede" />\
        <p>Durch das Schaffen eines Gefühls des Zusammengehörens bildet dieser Schritt die Grundlage für das Verhexen der Massen.</p>\
        <hr />\
        <img src="https://img1.tucang.cc/api/image/show/e6fef584fde81c7de88ff418817d4093" alt="Dämonisierung" />\
        <p>Anschließend, oft während einer Krise, beschreiben faschistische Politiker die Situation als Ergebnis äußerer Feinde, die sie als Quelle der Katastrophe dämonisieren, was ein Gefühl der Angst in der Gesellschaft erzeugt.</p>\
        <img src="https://img1.tucang.cc/api/image/show/90f2f6da5a06050a91807e5a85c5ca84" alt="Massenhysterie" />\
        <p>In diesem Stadium tritt der Effekt der <strong>Massenhysterie</strong> auf, Menschen sind eher bereit, Illusionen von Angst, Unterdrückung und Bedrohung zu haben.</p>\
        <hr />\
        <img src="https://img1.tucang.cc/api/image/show/1c6bb86210c61a98ce7e62897146fb95" alt="Spektakel" />\
        <p>In offiziellen Medien, ständige massive Kräfte und charismatische mächtige Herrscher sind typischerweise das Thema. Große politische Gesten und öffentliche Spektakel finden im ganzen Land häufig statt, mit Tausenden und Abertausenden von Zuschauern.</p>\
        <img src="https://img1.tucang.cc/api/image/show/15589498a28ddc590d52889854b23f56" alt="Entindividualisierung" />\
        <p>In solchen massiven Szenarien treibt die <strong>Entindividualisierung</strong> die Menschen dazu, verrückte und irrationale Verhaltensweisen in großen Gruppen zu zeigen und ihre Individualität zu verlieren.</p>\
        <hr />\
        <img src="https://img1.tucang.cc/api/image/show/d3e702d38c2d34c849965e735a2700e6" alt="Heiligkeit des Todes" />\
        <p>In faschistischen Militärorganisationen wird die Heiligkeit des Todes immer betont, als Symbol der Loyalität und der Verbindung zu bestimmten größeren Zwecken und Existenz jenseits des Einzelnen.</p>\
        <img src="https://img1.tucang.cc/api/image/show/b365e7d4200e9bba413042ce8d1b936f" alt="Beziehung zur Nation" />\
        <p>Die <strong>Terror-Management-Theorie</strong> besagt, dass Menschen, wenn sie an ihre Sterblichkeit erinnert werden, eher dazu neigen, kulturelle Weltanschauungen anzunehmen. Im Kontext faschistischer Werte kann diese Abhängigkeit von Glauben zur Bildung radikaler Kulte und Faschisten führen.</p>\
        <hr />\
        <img src="https://img1.tucang.cc/api/image/show/c70d1d8b96bb602c00b5416064932f41" alt="Historische Rückkehr" />\
        <p>Mehrere Interpretationen dieser Phänomene wurden gefunden. Die am häufigsten verbreitete lässt sich bis in die prähistorische Zeit zurückverfolgen, als Menschen noch ums Überleben kämpften. Wer den kollektiven Bedenken über potenzielle Gefahren folgte, hatte die besten Überlebenschancen.</p>\
        <hr />\
        <h2>Referenzen</h2>\
        <ol>\
            <li>LaKeisha Fleming, 8. Januar 2024, <a href="https://www.verywellmind.com/deindividuation-7546896">Entindividualisierung: Wie die Anwesenheit anderer das Verhalten beeinflusst</a></li>\
            <li>Lisa Fritscher, 12. Dezember 2023, <a href="https://www.verywellmind.com/understanding-groupthink-2671595">Was ist Massenhysterie (Massenpsychose)?</a></li>\
            <li>Mark Neocleous, Februar 2005, <em>Lang lebe der Tod! Faschismus, Auferstehung, Unsterblichkeit</em>, entnommen aus Journal of Political Ideologies (Februar 2005), 10 (1), 31–49</li>\
            <li>Practical Psychology, 20. Oktober 2023, <a href="https://practicalpie.com/terror-management-theory/">Terror-Management-Theorie (Definition + Beispiele)</a></li>\
        </ol>\
        <p style="text-align: right;">Copyright ©️ Hēsperus</p>\
    '
}