{
    "introduction": "Der Inhalt ist eine Schritt-für-Schritt-Anleitung zur Erstellung einer kostenlosen persönlichen Website mit GitHub Pages, die von der Registrierung bei GitHub bis zur Bereitstellung und Optimierung der Website alles abdeckt.",
    "content": "<h1>Eine Website kostenlos erstellen</h1> <hr> <h2>Überblick</h2> <p>Ein Blog wird verwendet, um <strong>Lebensmomente festzuhalten</strong> und Einblicke zu teilen (hauptsächlich, um die strenge Inhaltsmoderation in sozialen Medien zu umgehen). Für Anfänger kann das Einrichten eines Blogs jedoch den Kauf eines Servers, den Erwerb eines Domainnamens, die Konfiguration der Umgebung, die Registrierung eines Zertifikats und sogar die behördliche Registrierung umfassen – was äußerst mühsam sein kann.</p> <p>Wir werden <strong>GitHub</strong>, die weltweit größte Code-Hosting-Plattform, verwenden (ein VPN ist nicht erforderlich, wenn Ihre Internetgeschwindigkeit gut genug ist). Dort sind viele Open-Source-Projekte verfügbar. Da Microsoft GitHub übernommen hat, ist seine Stabilität gewährleistet.</p> <hr> <h2>Prozess</h2> <h3>1. Registrieren Sie sich bei GitHub</h3> <p><img src='https://img.picui.cn/free/2025/03/04/67c71f0a990ea.jpg' alt='Anmeldung'><br>Registrieren Sie ein GitHub-Konto unter <a href='https://github.com/'>https://github.com</a>. Geben Sie Ihren Benutzernamen, Ihre E-Mail-Adresse und Ihr Passwort ein und bestätigen Sie dann Ihre E-Mail-Adresse.</p> <h3>2. Erstellen Sie ein neues Repository</h3> <p><img src='https://img.picui.cn/free/2025/03/04/67c721b6c8002.png' alt='Repository erstellen'><br>Klicken Sie auf die Schaltfläche <strong>&quot;+&quot;</strong> in der oberen rechten Ecke und wählen Sie <strong>&quot;New Repository&quot;</strong>, um ein neues Repository zu erstellen.</p> <h3>3. Legen Sie den Repository-Namen fest</h3> <p><img src='https://img.picui.cn/free/2025/03/04/67c71f0a750fd.png' alt='Repository benennen'><br>Geben Sie im Feld <strong>Repository name</strong> Ihren Repository-Namen als <strong>(Ihr GitHub Benutzername).github.io</strong> ein (dies wird Ihr Domainname sein). Belassen Sie alle anderen Optionen standardmäßig und klicken Sie dann auf <strong>&quot;Create Repository&quot;</strong>.</p> <h3>4. Erstellen Sie ein Codespace</h3> <p><img src='https://img.picui.cn/free/2025/03/04/67c71f0a87768.png' alt='Code starten'><br>Nachdem Sie die Repository-Seite betreten haben, klicken Sie auf <strong>&quot;Create a Codespace&quot;</strong> und bestätigen Sie (dieser Vorgang kann einige Zeit dauern).</p> <h3>5. Erstellen Sie eine HTML-Datei</h3> <p><img src='https://img.picui.cn/free/2025/03/04/67c721b6c30b2.png' alt='index.html'><br>Erstellen Sie auf Ihrem Computer eine neue Textdatei mit dem Namen <strong>index.txt</strong> und schreiben Sie einige grundlegende HTML-Codes hinein. Speichern Sie dann die Datei und benennen Sie die Erweiterung in <strong>.html</strong> um.</p> <h3>6. Laden Sie die Datei auf GitHub hoch</h3> <p><img src='https://img.picui.cn/free/2025/03/04/67c721b6112b6.png' alt='Datei hochladen'><br>Ziehen Sie Ihre <strong>index.html</strong>-Datei per Drag-and-Drop auf Ihre GitHub-Repository-Webseite und klicken Sie dann unten auf <strong>&quot;Commit Changes&quot;</strong>.</p> <h3>7. Aktivieren Sie GitHub Pages</h3> <p><img src='https://img.picui.cn/free/2025/03/04/67c721b72968f.png' alt='GitHub-Seite'><br>Gehen Sie zu <strong>Settings &gt; Pages</strong> und ändern Sie die Option <strong>branch</strong> von <strong>None</strong> zu <strong>Main</strong> und klicken Sie auf <strong>&quot;Save&quot;</strong>. Warten Sie etwa eine Minute auf die Bereitstellung.</p> <h3>8. Bestätigen Sie die Bereitstellung</h3> <p><img src='https://img.picui.cn/free/2025/03/04/67c71f0a876dc.png' alt='Seite wurde erstellt'><br>Aktualisieren Sie die Seite, und Sie sollten eine Erfolgsmeldung sehen.</p> <h3>9. Besuchen Sie Ihre Website</h3> <p><img src='https://img.picui.cn/free/2025/03/04/67c71f0a87e7c.png' alt='Ergebnis'><br>Öffnen Sie Ihren Browser und besuchen Sie <strong>(Ihr GitHub Benutzername).github.io</strong> – Ihre Website ist jetzt live! Herzlichen Glückwunsch, Sie haben Ihre erste persönliche Website erfolgreich veröffentlicht.</p> <hr> <h2>Fazit</h2> <p>Obwohl GitHub Pages kostenlos ist, gibt es einige Einschränkungen:</p> <ul> <li><strong>Repository-Größe:</strong> Begrenzt auf 1 GB</li> <li><strong>Upload-Limit für einzelne Dateien:</strong> 100 MB</li> <li><strong>Monatliches Bandbreitenlimit:</strong> 100 GB (was in der Regel ausreichend ist)</li> </ul> <p>Um die Leistung zu optimieren, empfehle ich dringend, einen inländischen <strong>Bildhosting-Dienst</strong> für die Speicherung von Bildern zu verwenden. Dies verringert die Belastung von GitHub, spart Speicherplatz und beschleunigt den Zugriff.</p> <p>Dieses Tutorial kratzt nur an der Oberfläche der Website-Entwicklung. Um mehr Anpassungen vorzunehmen, sollten Sie <strong>CSS</strong> und <strong>JavaScript</strong> lernen. Dank der rasanten Fortschritte bei <strong>großen Sprachmodellen (LLMs)</strong> sieht die Zukunft der No-Code-Entwicklung sehr vielversprechend aus.</p>"
}